In [53]:
import pandas as pd

In [54]:
dict_1 = {
    "rank":[12,34,67,34],
    "age" : [22,12,34,21]
}

In [55]:
df = pd.DataFrame(dict_1)

In [66]:
df.to_excel('data.xlsx',index= False)

In [56]:
df

   rank  age
0    12   22
1    34   12
2    67   34
3    34   21

In [57]:
df.describe()

            rank        age
count   4.000000   4.000000
mean   36.750000  22.250000
std    22.677081   9.032349
min    12.000000  12.000000
25%    28.500000  18.750000
50%    34.000000  21.500000
75%    42.250000  25.000000
max    67.000000  34.000000

In [58]:
df.mean()

rank    36.75
age     22.25
dtype: float64

In [59]:
df.count()

rank    4
age     4
dtype: int64

In [60]:
df.corr()

         rank      age
rank  1.00000  0.63997
age   0.63997  1.00000

In [61]:
df.max()

rank    67
age     34
dtype: int64

In [62]:
df.min()

rank    12
age     12
dtype: int64

In [63]:
df.median()

rank    34.0
age     21.5
dtype: float64

In [64]:
df.std()

rank    22.677081
age      9.032349
dtype: float64

In [72]:
data = pd.read_excel('data.xlsx')

In [73]:
data.iloc[0,0] = 34

In [74]:
data

   rank  age
0    34   22
1    34   12
2    67   34
3    34   21